# YOLOv7 简化版测试配置
nc: 80
depth_multiple: 1.0
width_multiple: 1.0
anchors:
  - [12, 16, 19, 36, 40, 28]
  - [36, 75, 76, 55, 72, 146]
  - [142, 110, 192, 243, 459, 401]

backbone:
  - [-1, 1, Conv, [32, 3, 1]] # 0
  - [-1, 1, Conv, [64, 3, 2]] # 1
  - [-1, 1, Conv, [64, 3, 1]] # 2
  - [-1, 1, Conv, [128, 3, 2]] # 3
  - [-1, 1, ELAN, [128, 64, 1]] # 4
  - [-1, 1, MPConv, []] # 5
  - [-1, 1, ELAN, [256, 128, 1]] # 6

head:
  - [[-1], 1, YOLOv7Detect, [nc]]
