# YOLOv2 (YOLO9000) 网络结构配置文件
# 参考: YOLO9000: Better, Faster, Stronger

# 参数配置
nc: 80 # COCO数据集80个类别
depth_multiple: 1.0
width_multiple: 1.0
anchors: # YOLOv2使用的先验框尺寸(COCO数据集)
  - [1.3221, 1.73145]
  - [3.19275, 4.00944]
  - [5.05587, 8.09892]
  - [9.47112, 4.84053]
  - [11.2364, 10.0071]

# Darknet-19 骨干网络
backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [32, 3, 1, 1]] # 0
  - [-1, 1, nn.MaxPool2d, [2, 2]] # 1-P1/2
  - [-1, 1, Conv, [64, 3, 1, 1]] # 2
  - [-1, 1, nn.MaxPool2d, [2, 2]] # 3-P2/4
  - [-1, 1, Conv, [128, 3, 1, 1]] # 4
  - [-1, 1, Conv, [64, 1, 1, 0]] # 5
  - [-1, 1, Conv, [128, 3, 1, 1]] # 6
  - [-1, 1, nn.MaxPool2d, [2, 2]] # 7-P3/8
  - [-1, 1, Conv, [256, 3, 1, 1]] # 8
  - [-1, 1, Conv, [128, 1, 1, 0]] # 9
  - [-1, 1, Conv, [256, 3, 1, 1]] # 10
  - [-1, 1, nn.MaxPool2d, [2, 2]] # 11-P4/16
  - [-1, 1, Conv, [512, 3, 1, 1]] # 12
  - [-1, 1, Conv, [256, 1, 1, 0]] # 13
  - [-1, 1, Conv, [512, 3, 1, 1]] # 14
  - [-1, 1, Conv, [256, 1, 1, 0]] # 15
  - [-1, 1, Conv, [512, 3, 1, 1]] # 16
  - [-1, 1, nn.MaxPool2d, [2, 2]] # 17-P5/32
  - [-1, 1, Conv, [1024, 3, 1, 1]] # 18
  - [-1, 1, Conv, [512, 1, 1, 0]] # 19
  - [-1, 1, Conv, [1024, 3, 1, 1]] # 20
  - [-1, 1, Conv, [512, 1, 1, 0]] # 21
  - [-1, 1, Conv, [1024, 3, 1, 1]] # 22

# YOLOv2 检测头
head:
  - [-1, 1, Conv, [1024, 3, 1, 1]] # 23
  - [-1, 1, Conv, [1024, 3, 1, 1]] # 24

  # Passthrough层 (特征重组，将高分辨率特征与语义特征融合)
  - [16, 1, Passthrough, []] # 25 从第16层获取特征

  - [[24, 25], 1, Concat, [1]] # 26 特征拼接
  - [-1, 1, Conv, [3072, 3, 1, 1]] # 27 自动推导输入通道数

  # 检测层: 输出维度为 (batch, height, width, anchors*(5+classes))
  # 对于COCO: 5个anchor * (5+80) = 425
  - [-1, 1, Conv, [425, 1, 1, 0]] # 28

  # YOLOv2检测层
  - [[28], 1, YOLOv2Detect, []] # 29
