# YOLOv1 网络结构配置文件
# 参考: You Only Look Once: Unified, Real-Time Object Detection

# 参数配置
nc: 20 # 默认使用PASCAL VOC的20个类别
depth_multiple: 1.0 # 模型深度倍数
width_multiple: 1.0 # 层通道数倍数

# 骨干网络 (Backbone)
backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [64, 7, 2, 3]] # 0-P1/2
  - [-1, 1, nn.MaxPool2d, [2, 2]] # 1-P2/4
  - [-1, 1, Conv, [192, 3, 1, 1]] # 2
  - [-1, 1, nn.MaxPool2d, [2, 2]] # 3-P3/8
  - [-1, 1, Conv, [128, 1, 1, 0]] # 4
  - [-1, 1, Conv, [256, 3, 1, 1]] # 5
  - [-1, 1, Conv, [256, 1, 1, 0]] # 6
  - [-1, 1, Conv, [512, 3, 1, 1]] # 7
  - [-1, 1, nn.MaxPool2d, [2, 2]] # 8-P4/16
  - [-1, 4, C2f, [512, True]] # 9-12 - 输出通道数512, 4个Bottleneck
  - [-1, 1, Conv, [512, 1, 1, 0]] # 13
  - [-1, 1, Conv, [1024, 3, 1, 1]] # 14
  - [-1, 1, nn.MaxPool2d, [2, 2]] # 15-P5/32
  - [-1, 2, C2f, [1024, True]] # 16-17 - 输出通道数1024, 2个Bottleneck
  - [-1, 1, Conv, [1024, 3, 1, 1]] # 18
  - [-1, 1, Conv, [1024, 3, 2, 1]] # 19
  - [-1, 1, Conv, [1024, 3, 1, 1]] # 20
  - [-1, 1, Conv, [1024, 3, 1, 1]] # 21

# 检测头 (Head)
head:
  - [-1, 1, nn.Flatten, []] # 22 展平层
  - [-1, 1, nn.Linear, [102400, 4096]] # 23 全连接层 实际计算得出的维度 -> 4096
  - [-1, 1, nn.Dropout, [0.5]] # 24 Dropout层
  - [-1, 1, nn.Linear, [4096, 1470]] # 25 输出层: 7*7*(2*5+20)=1470
  - [-1, 1, Reshape, [7, 7, 30]] # 26 重塑为最终输出格式
  - [-1, 1, YOLOv1Detect, [nc]] # 27 检测层
