# YOLOv7 网络结构配置文件
# 参考: YOLOv7: Trainable bag-of-freebies sets new state-of-the-art for real-time object detectors

# 参数配置
nc: 80  # 类别数
depth_multiple: 1.0  # 模型深度倍数
width_multiple: 1.0  # 层通道数倍数
anchors:
  - [12,16, 19,36, 40,28]    # P3/8
  - [36,75, 76,55, 72,146]   # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# 骨干网络 (Backbone)
backbone:
  # [from, number, module, args]
  # 初始卷积层
  - [-1, 1, Conv, [32, 3, 1]]  # 0-P1/2
  - [-1, 1, Conv, [64, 3, 2]]  # 1-P2/4
  - [-1, 1, Conv, [64, 3, 1]]  # 2
  - [-1, 1, Conv, [128, 3, 2]] # 3-P3/8
  - [-1, 1, ELAN, [128, 64, 1]] # 4

  - [-1, 1, MPConv, []]        # 5-P4/16
  - [-1, 1, ELAN, [256, 128, 1]] # 6

  - [-1, 1, MPConv, []]        # 7-P5/32
  - [-1, 1, ELAN, [512, 256, 1]] # 8

  - [-1, 1, MPConv, []]        # 9
  - [-1, 1, ELAN, [512, 256, 1]] # 10

  - [-1, 1, SPPCSPC, [256]]    # 11

# 颈部网络 (Neck)
neck:
  # 上采样路径
  - [-1, 1, Conv, [128, 1, 1]]   # 12
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 13
  - [[-1, 6], 1, Concat, [1]]    # 14 连接第6层
  - [-1, 1, ELAN, [256, 128, 1]] # 15

  - [-1, 1, Conv, [64, 1, 1]]    # 16
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 17
  - [[-1, 4], 1, Concat, [1]]    # 18 连接第4层
  - [-1, 1, ELAN, [128, 64, 1]]  # 19 (P3/8-small)

  # 下采样路径
  - [-1, 1, MPConv, []]          # 20-P4/16
  - [[-1, 15], 1, Concat, [1]]   # 21 连接第15层
  - [-1, 1, ELAN, [256, 128, 1]] # 22 (P4/16-medium)

  - [-1, 1, MPConv, []]          # 23-P5/32
  - [[-1, 11], 1, Concat, [1]]   # 24 连接第11层
  - [-1, 1, ELAN, [512, 256, 1]] # 25 (P5/32-large)

# 检测头 (Head)
head:
  # 主检测头
  - [[19, 22, 25], 1, RepConv, []]  # 重参数化卷积
  - [[-3, -2, -1], 1, YOLOv7Detect, [nc, anchors]]   # 检测层

  # 辅助检测头 (仅训练时使用)
  - [[19, 22, 25], 1, RepConv, []]  # 重参数化卷积
  - [[-3, -2, -1], 1, YOLOv7AuxDetect, [nc, anchors]]   # 辅助检测层