# YOLOv4 完整版网络结构配置 - 修正版
# 参考: YOLOv4: Optimal Speed and Accuracy of Object Detection
# 基于成功的简化版本扩展，保持架构完整性的同时确保正确解析

# 参数配置
nc: 80 # COCO数据集80个类别
depth_multiple: 1.0
width_multiple: 1.0
anchors:
  - [12, 16, 19, 36, 40, 28] # P3/8
  - [36, 75, 76, 55, 72, 146] # P4/16
  - [142, 110, 192, 243, 459, 401] # P5/32

# CSPDarknet53 骨干网络 - 更完整版本
backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [32, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [64, 3, 2]] # 1-P2/4
  - [-1, 1, CSPBlock, [64]] # 2
  - [-1, 1, Conv, [128, 3, 2]] # 3-P3/8
  - [-1, 3, CSPBlock, [128]] # 4
  - [-1, 1, Conv, [256, 3, 2]] # 5-P4/16
  - [-1, 5, CSPBlock, [256]] # 6 增加CSP块数量
  - [-1, 1, Conv, [512, 3, 2]] # 7-P5/32
  - [-1, 5, CSPBlock, [512]] # 8 增加CSP块数量
  - [-1, 1, SPP, [512, [5, 9, 13]]] # 9 SPP模块

# 颈部网络 (Neck): SPP + PANet - 完整版本
head:
  # 上采样路径 (自顶向下)
  - [-1, 1, Conv, [256, 1, 1]] # 10
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]] # 12 cat backbone P4
  - [-1, 3, CSPBlock, [256]] # 13

  - [-1, 1, Conv, [128, 1, 1]] # 14
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 4], 1, Concat, [1]] # 16 cat backbone P3
  - [-1, 3, CSPBlock, [128]] # 17 (P3/8-small)

  # 下采样路径 (自底向上)
  - [-1, 1, Conv, [256, 3, 2]] # 18
  - [[-1, 13], 1, Concat, [1]] # 19 cat head P4
  - [-1, 3, CSPBlock, [256]] # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 21
  - [[-1, 9], 1, Concat, [1]] # 22 cat head P5
  - [-1, 3, CSPBlock, [512]] # 23 (P5/32-large)

  - [[17, 20, 23], 1, YOLOv4Detect, [nc]] # 24 YOLOv4 Detection
